RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_audio.c
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio Set HPF Parameter
 *
 * @param  id: ADC ID
 * @param  k1_enable: k1 parameter enable
 * @param  k1: k1 parameter in range 4 bit
 * @param  k2_enable: k2 parameter enable
 * @param  k2: k1 parameter in range 4 bit
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_HPF_Parameter(Audio_ADC_ID_Type id, uint8_t k1_enable, uint8_t k1, uint8_t k2_enable, uint8_t k2)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_1);

    switch (id) {
        case AUDIO_ADC_0:
            if (k1_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_0_K1_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_0_K1, k1);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_0_K1_EN);
            }
            if (k2_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_0_K2_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_0_K2, k2);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_0_K2_EN);
            }
            break;
        case AUDIO_ADC_1:
            if (k1_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_1_K1_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_K1, k1);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_1_K1_EN);
            }
            if (k2_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_1_K2_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_K2, k2);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_1_K2_EN);
            }
            break;
        case AUDIO_ADC_2:
            if (k1_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_2_K1_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_2_K1, k1);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_2_K1_EN);
            }

            if (k2_enable) {
                tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_2_K2_EN);
                tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_2_K2, k2);
            } else {
                tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_2_K2_EN);
            }
            break;
        default:
            break;
    }

    BL_WR_REG(AUDIO_BASE, AUDIO_ADC_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio Set ADC Source PDM or Analog
 *
 * @param  id: k1 parameter in range 4 bit ,when k0=0 k0 parameter will disabled
 * @param  adc_source: k2 parameter in range 4 bit ,when k1=0 k1 parameter will disabled
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_ADC_Source(Audio_ADC_ID_Type id, Audio_ADC_Source_Type adc_source)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_0);

    if (id == AUDIO_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_0_SRC, adc_source);
    } else if (id == AUDIO_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_SRC, adc_source);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_2_SRC, adc_source);
    }

    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio AEC enable
 *
 * @param  id: Auido AEC ID
 *
 * @return None
 *
*******************************************************************************/
void Audio_AEC_Enable(Audio_AEC_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_AEC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    if (id == AUDIO_AEC_0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_AEC_0_EN);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_AEC_1_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio AEC disable
 *
 * @param  id: Auido AEC ID
 *
 * @return None
 *
*******************************************************************************/
void Audio_AEC_Disable(Audio_AEC_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_AEC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    if (id == AUDIO_AEC_0) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_AEC_0_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_AEC_1_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio ADC enable
 *
 * @param  id: Auido ADC ID
 *
 * @return None
 *
*******************************************************************************/
void Audio_ADC_Enable(Audio_ADC_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    if (id == AUDIO_ADC_0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_0_EN);
    } else if (id == AUDIO_ADC_1) {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_1_EN);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_ADC_2_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio ADC disable
 *
 * @param  id: Auido ADC ID
 *
 * @return None
 *
*******************************************************************************/
void Audio_ADC_Disable(Audio_ADC_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    if (id == AUDIO_ADC_0) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_0_EN);
    } else if (id == AUDIO_ADC_1) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_1_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_ADC_2_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio DAC disable
 *
 * @param  id: Auido DAC ID
 *
 * @return None
 *
*******************************************************************************/
void Audio_DAC_Enable(Audio_DAC_ID_Type id)
{
    uint32_t tmpVal = 0;

