RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_audio.c
    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    if (id == AUDIO_DAC_0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_DAC_0_EN);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_DAC_1_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio DAC disable
 *
 * @param  id: Auido DAC ID
 *
 * @return None
 *
*******************************************************************************/
void Audio_DAC_Disable(Audio_DAC_ID_Type id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_ITF);
    if (id == AUDIO_DAC_0) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_DAC_0_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_DAC_1_EN);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_ITF, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set dac amp
 *
 * @param  enable: enable or noy
 * @param  amp: amp
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_DAC_Dither(uint8_t enable, uint8_t amp)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_1);

    if (enable) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_DITHER_EN, 1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_DITHER_AMP, amp);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_DITHER_EN, 0);
    }

    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set dac scaling
 *
 * @param  enable: enable or noy
 * @param  scaling: scaling
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_DAC_Scaling(uint8_t enable, uint8_t scaling)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_1);
    if (enable) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_SCALING_EN, 1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_SCALING_FACTOR, scaling);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_SCALING_EN, 0);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set order
 *
 * @param  order: order
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_DAC_Order(Audio_DAC_Order_Type order)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ORDER_TYPE(order));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DSM_ORDER, order);
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio_Set_DAC_Dwa_Swap
 *
 * @param  swap: None
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_DAC_Dwa_Swap(uint8_t swap)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DEM_OUT_SWAP, swap);
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio_Set_DAC_Dsm_Bypass
 *
 * @param  bypass: None
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_DAC_Dwa_Bypass(uint8_t bypass)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_DEM_BYPASS, bypass);
    BL_WR_REG(AUDIO_BASE, AUDIO_DAC_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Audio set adc lfsr
 *
 * @param  lfsrType: Auido ADC LFSR TYPE
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_DAC_LFSR(Audio_LFSR_Type lfsrType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_LFSR_TYPE(lfsrType));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_LFSR_MODE, lfsrType);
    BL_WR_REG(AUDIO_BASE, AUDIO_ADC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  read LSFR
 *
 * @param  None
 *
 * @return read LSFR out
 *
*******************************************************************************/
BL_Sts_Type Audio_Get_ADC_LFSR(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_0);
    return BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_DITHER_DATA);
}

/****************************************************************************/ /**
 * @brief  set adc scaling value
 *
 * @param  id: Auido ADC ID
 * @param  scalingVal: scaling value
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_ADC_Scaling_Value(Audio_ADC_ID_Type id, uint8_t scalingVal)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_0);

    if (id == AUDIO_ADC_0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_0_SCAL, scalingVal);
    } else if (id == AUDIO_ADC_1) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_1_SCAL, scalingVal);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_2_SCAL, scalingVal);
    }
    BL_WR_REG(AUDIO_BASE, AUDIO_ADC_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  set fir mode
 *
 * @param  id: Auido ADC ID
 * @param  enable: enable or disable
 *
 * @return None
 *
*******************************************************************************/
void Audio_Set_Fir_Mode(Audio_ADC_ID_Type id, uint8_t enable)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_0);

