RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_audio.c
    tmpVal = BL_RD_WORD(adcVolumeConfigAddrOffset + 0x04);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_CTRL_ZCD_TIMEOUT, cfg->volumeZeroCrossTimeout);
    BL_WR_WORD(adcVolumeConfigAddrOffset + 0x04, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio DAC Volume Config
 *
 * @param  dac_id: dac id
 * @param  cfg: volume config cfg pointer
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Audio_DAC_Software_Volume_Config(Audio_DAC_ID_Type dac_id, Audio_Volume_Cfg_Type *cfg)
{
    uint32_t dacVolumeConfigAddrOffset = AUDIO_BASE + 0x434 + dac_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(dac_id));
    CHECK_PARAM(IS_AUDIO_MUTE_MODE(cfg->muteMode));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->muteRmpdnRate));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->muteRmpupRate));
    CHECK_PARAM(IS_AUDIO_VOLUME_CTR_MODE(cfg->volumeCtrMode));
    CHECK_PARAM(IS_AUDIO_ZERO_CROSS_RATE_TYPE(cfg->resovolumeZeroCrossRatelution));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->volumeRmpRate));

    if (dac_id > 1) {
        return ERROR;
        /*only support 2 dac*/
    }

    tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_MUTE_SOFTMODE, cfg->muteMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_MUTE_RMPDN_RATE, cfg->muteRmpdnRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_MUTE_RMPUP_RATE, cfg->muteRmpupRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_CTRL_MODE, cfg->volumeCtrMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_CTRL_ZCD_RATE, cfg->volumeZeroCrossRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_CTRL_RMP_RATE, cfg->volumeRmpRate);
    BL_WR_WORD(dacVolumeConfigAddrOffset, tmpVal);

    tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset + 0x04);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_CTRL_ZCD_TIMEOUT, cfg->volumeZeroCrossTimeout);
    BL_WR_WORD(dacVolumeConfigAddrOffset + 0x04, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio set adc volume
 *
 * @param  volumeSyncAllAdc: sync volume configuration for three adc channel
 * @param  adc_id: adc id
 * @param  volume: volume
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Audio_ADC_Set_Volume(BL_Fun_Type volumeSyncAllAdc, Audio_ADC_ID_Type adc_id, uint16_t volume)
{
    uint32_t adcVolumeAddrOffset = AUDIO_BASE + 0x408 + adc_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));

    if (adc_id > 2) {
        return ERROR;
        /*only support 3 adc*/
    }

    if (volumeSyncAllAdc) {
        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x408);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x408, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x410);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S1_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x410, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x418);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S2_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x418, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x408 + 0x04);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S012_VOLUME_UPDATE, 1);
        BL_WR_WORD(AUDIO_BASE + 0x408 + 0x04, tmpVal);

        //TODO AUDIO_ADC_SX_VOLUME_UPDATE/AUDIO_ADC_S012_VOLUME_UPDATE should be reset in isr

    } else {
        tmpVal = BL_RD_WORD(adcVolumeAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME, volume);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME_UPDATE, 1);
        BL_WR_WORD(adcVolumeAddrOffset, tmpVal);

        //TODO AUDIO_ADC_SX_VOLUME_UPDATE/AUDIO_ADC_S012_VOLUME_UPDATE should be reset in isr
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio set dac volume
 *
 * @param  volumeSyncAllDac: sync volume configuration for two dac channel
 * @param  dac_id: dac id
 * @param  volume: volume
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Audio_DAC_Set_Volume(BL_Fun_Type volumeSyncAllDac, Audio_DAC_ID_Type dac_id, uint16_t volume)
{
    uint32_t dacVolumeConfigAddrOffset = AUDIO_BASE + 0x434 + dac_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(dac_id));

    if (dac_id > 1) {
        return ERROR;
        /*only support 2 dac*/
    }

    if (volumeSyncAllDac) {
        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x434);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x434, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x43c);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S1_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x43c, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x434 + 0x04);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S01_VOLUME_UPDATE, 1);
        BL_WR_WORD(AUDIO_BASE + 0x434 + 0x04, tmpVal);

        //TODO AUDIO_DAC_SX_VOLUME_UPDATE/AUDIO_DAC_S01_VOLUME_UPDATE should be reset in isr

    } else {
        tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME, volume);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME_UPDATE, 1);
        BL_WR_WORD(dacVolumeConfigAddrOffset, tmpVal);

        //TODO AUDIO_DAC_SX_VOLUME_UPDATE/AUDIO_DAC_S01_VOLUME_UPDATE should be reset in isr
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  clear adc update bit
 *
 * @param  adc_id: adc id
 *
 * @return None
 *
*******************************************************************************/
void Audio_ADC_Reset_Volume_Update(Audio_ADC_ID_Type adc_id)
{
    uint32_t adcVolumeAddrOffset = AUDIO_BASE + 0x408 + adc_id * 0x08;
    uint32_t tmpVal = 0;

