RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_audio.c
    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));

    if (adc_id > 2) {
        return;
        /*only support 3 adc*/
    }

    tmpVal = BL_RD_WORD(adcVolumeAddrOffset);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME, 0);
    BL_WR_WORD(adcVolumeAddrOffset, tmpVal);
}

/****************************************************************************/ /**
 * @brief  clear dac update bit
 *
 * @param  dac_id: dac id
 *
 * @return None
 *
*******************************************************************************/
void Audio_DAC_Reset_Volume_Update(Audio_DAC_ID_Type dac_id)
{
    uint32_t dacVolumeConfigAddrOffset = AUDIO_BASE + 0x434 + dac_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(dac_id));

    if (dac_id > 1) {
        return;
        /*only support 2 dac*/
    }

    tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME, 0);
    BL_WR_WORD(dacVolumeConfigAddrOffset, tmpVal);
}

/****************************************************************************/ /**
 * @brief  clear adc or dac all update bit, when enable sync bit to set all channel dac/adc volume
 *         ,user should use this function to clear all update flag.
 *
 * @param  isAdcOrDac: IS ADC or DAC,ADC=1 DAC=0
 *
 * @return None
 *
*******************************************************************************/
void Audio_Reset_Volume_All_Update(uint8_t isAdcOrDac)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));
    if (isAdcOrDac) {
        BL_RD_REG(AUDIO_BASE, AUDIO_ADC_S0_MISC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S012_VOLUME_UPDATE, 0);
        BL_WR_REG(AUDIO_BASE, AUDIO_ADC_S0_MISC, tmpVal);
    } else {
        BL_RD_REG(AUDIO_BASE, AUDIO_DAC_S0_MISC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S01_VOLUME_UPDATE, 0);
        BL_WR_REG(AUDIO_BASE, AUDIO_DAC_S0_MISC, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  Audio set all adc volume Reg Without seting update bit
 *
 * @param  volumeSyncAllAdc: is set all adc
 * @param  adc_id: adc id
 * @param  volume: volume
 *
 * @return Success or Not
 *
*******************************************************************************/
BL_Err_Type Audio_ADC_Set_Volume_Reg(BL_Fun_Type volumeSyncAllAdc, Audio_ADC_ID_Type adc_id, uint16_t volume)
{
    uint32_t adcVolumeAddrOffset = AUDIO_BASE + 0x408 + adc_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));

    if (adc_id > 2) {
        return ERROR;
        /*only support 3 adc*/
    }

    if (volumeSyncAllAdc) {
        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x408);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x408, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x410);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S1_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x410, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x418);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S2_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x418, tmpVal);

    } else {
        tmpVal = BL_RD_WORD(adcVolumeAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME, volume);
        BL_WR_WORD(adcVolumeAddrOffset, tmpVal);
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio set all DAC volume Reg Without seting update bit
 *
 * @param  volumeSyncAllDac: is set all dac
 * @param  dac_id: dac id
 * @param  volume: volume
 *
 * @return Success or Not
 *
*******************************************************************************/
BL_Err_Type Audio_DAC_Set_Volume_Reg(BL_Fun_Type volumeSyncAllDac, Audio_DAC_ID_Type dac_id, uint16_t volume)
{
    uint32_t dacVolumeConfigAddrOffset = AUDIO_BASE + 0x434 + dac_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(dac_id));

    if (dac_id > 1) {
        return ERROR;
        /*only support 2 dac*/
    }

    if (volumeSyncAllDac) {
        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x434);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x434, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x43c);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S1_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x43c, tmpVal);

    } else {
        tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME, volume);
        BL_WR_WORD(dacVolumeConfigAddrOffset, tmpVal);
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio set adc volume
 *
 * @param  volumeSyncAllAdc: sync volume configuration for three adc channel,This function will
 *                           blocking CPU until volume adjust task done
 * @param  adc_id: adc id
 * @param  volume: volume
 * @param  blockTimeout: volume block timeout
 *
 * @return Configuration is success
 *
*******************************************************************************/
BL_Err_Type Audio_ADC_Set_Volume_Block(BL_Fun_Type volumeSyncAllAdc, Audio_ADC_ID_Type adc_id, uint16_t volume, uint32_t blockTimeout)
{
    uint32_t adcVolumeAddrOffset = AUDIO_BASE + 0x408 + adc_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));

    if (adc_id > 2) {
        return ERROR;
        /*only support 3 adc*/
    }

    if (volumeSyncAllAdc) {
        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x408);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x408, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x410);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S1_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x410, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x418);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S2_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x418, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x408 + 0x04);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S012_VOLUME_UPDATE, 1);
        BL_WR_WORD(AUDIO_BASE + 0x408 + 0x04, tmpVal);

        while (Audio_IS_ADC_Volume_Set_Busy(AUDIO_ADC_0) && Audio_IS_ADC_Volume_Set_Busy(AUDIO_ADC_1) && Audio_IS_ADC_Volume_Set_Busy(AUDIO_ADC_2)) {
            blockTimeout--;
            if (blockTimeout) {
                return TIMEOUT;
            }
        }
        //clear update
        tmpVal = BL_RD_WORD(adcVolumeAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S012_VOLUME_UPDATE, 0);
        BL_WR_WORD(adcVolumeAddrOffset, tmpVal);

    } else {
        tmpVal = BL_RD_WORD(adcVolumeAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME, volume);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME_UPDATE, 1);
        BL_WR_WORD(adcVolumeAddrOffset, tmpVal);

        while (Audio_IS_ADC_Volume_Set_Busy(adc_id)) {
            blockTimeout--;
            if (blockTimeout) {
                return TIMEOUT;
            }
        }
        //clear update
        tmpVal = BL_RD_WORD(adcVolumeAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME_UPDATE, 0);
        BL_WR_WORD(adcVolumeAddrOffset, tmpVal);
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio set dac volume
 *
 * @param  volumeSyncAllDac: sync volume configuration for two dac channel ,This function will
 *                           blocking CPU until volume adjust task done
 * @param  dac_id: adc id
 * @param  volume: volume
 * @param  blockTimeout: volume block timeout
 *
 * @return is success or not
 *
*******************************************************************************/
BL_Err_Type Audio_DAC_Set_Volume_Block(BL_Fun_Type volumeSyncAllDac, Audio_DAC_ID_Type dac_id, uint16_t volume, uint32_t blockTimeout)
{
    uint32_t dacVolumeConfigAddrOffset = AUDIO_BASE + 0x434 + dac_id * 0x08;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_DAC_ID_TYPE(dac_id));

