RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_audio.c
    if (dac_id > 1) {
        return ERROR;
        /*only support 2 dac*/
    }

    if (volumeSyncAllDac) {
        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x434);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x434, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x43c);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S1_VOLUME, volume);
        BL_WR_WORD(AUDIO_BASE + 0x43c, tmpVal);

        tmpVal = BL_RD_WORD(AUDIO_BASE + 0x434 + 0x04);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S01_VOLUME_UPDATE, 1);
        BL_WR_WORD(AUDIO_BASE + 0x434 + 0x04, tmpVal);

        while (Audio_IS_DAC_Volume_Set_Busy(AUDIO_DAC_0) && Audio_IS_DAC_Volume_Set_Busy(AUDIO_DAC_1)) {
            blockTimeout--;
            if (blockTimeout) {
                return TIMEOUT;
            }
        }
        //clear update
        tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S01_VOLUME_UPDATE, 0);
        BL_WR_WORD(dacVolumeConfigAddrOffset, tmpVal);

    } else {
        tmpVal = BL_RD_WORD(dacVolumeConfigAddrOffset);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME, volume);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME_UPDATE, 1);
        BL_WR_WORD(dacVolumeConfigAddrOffset, tmpVal);

        //TODO AUDIO_DAC_SX_VOLUME_UPDATE/AUDIO_DAC_S01_VOLUME_UPDATE should be reset in isr
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Audio set adc agc hardware volume config
 *
 * @param  cfg: cfg pointer
 *
 * @return None
 *
*******************************************************************************/
BL_Err_Type Audio_ADC_Hardware_Volume_Config(Audio_Volume_Cfg_Type *cfg)
{
    uint32_t adcVolumeConfigAddrOffset = AUDIO_BASE + AUDIO_ADC_H_OFFSET;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_MUTE_MODE(cfg->muteMode));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->muteRmpdnRate));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->muteRmpupRate));
    CHECK_PARAM(IS_AUDIO_VOLUME_CTR_MODE(cfg->volumeCtrMode));
    CHECK_PARAM(IS_AUDIO_ZERO_CROSS_RATE_TYPE(cfg->resovolumeZeroCrossRatelution));
    CHECK_PARAM(IS_AUDIO_RAMP_RATE_TYPE(cfg->volumeRmpRate));

    tmpVal = BL_RD_WORD(adcVolumeConfigAddrOffset);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_MUTE, cfg->muteMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_MUTE_RMPDN_RATE, cfg->muteRmpdnRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_MUTE_RMPUP_RATE, cfg->muteRmpupRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_CTRL_MODE, cfg->volumeCtrMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_CTRL_ZCD_RATE, cfg->volumeZeroCrossRate);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_CTRL_RMP_RATE, cfg->volumeRmpRate);
    BL_WR_WORD(adcVolumeConfigAddrOffset, tmpVal);

    tmpVal = BL_RD_WORD(adcVolumeConfigAddrOffset + 0x04);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_CTRL_ZCD_TIMEOUT, cfg->volumeZeroCrossTimeout);
    BL_WR_WORD(adcVolumeConfigAddrOffset + 0x04, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  when AGC is enable , software cannot change volume,but can read AGC ctrl result by this
 *         function
 *
 * @param  None
 *
 * @return AGC ctr result
 *
*******************************************************************************/
uint16_t Audio_ADC_Get_Hardware_Volume(void)
{
    uint32_t tmpVal = 0;
    uint16_t volume = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_H);
    volume = BL_GET_REG_BITS_VAL(tmpVal, AUDIO_ADC_H_VOLUME);

    return volume;
}

/****************************************************************************/ /**
 * @brief  when AGC is enable , software cannot change volume,but can read AGC ctrl result by this
 *         function
 *
 * @param  adc_id: adc id
 *
 * @return adc volume
 *
*******************************************************************************/
uint16_t Audio_ADC_Get_Volume(Audio_ADC_ID_Type adc_id)
{
    uint32_t tmpVal = 0;
    uint16_t volume = 0;

    if (adc_id == AUDIO_ADC_0) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_S0);
    } else if (adc_id == AUDIO_ADC_1) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_S1);
    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_ADC_S2);
    }

    volume = BL_GET_REG_BITS_VAL(tmpVal, AUDIO_ADC_S0_VOLUME);

    return volume;
}

/****************************************************************************/ /**
 * @brief  when AGC is enable , software cannot change volume,but can read AGC ctrl result by this
 *         function
 *
 * @param  dac_id: dac id
 *
 * @return dac volume
 *
*******************************************************************************/
uint16_t Audio_DAC_Get_Volume(Audio_DAC_ID_Type dac_id)
{
    uint32_t tmpVal = 0;

    if (dac_id == AUDIO_DAC_0) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_S0);
    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_DAC_S1);
    }

    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, AUDIO_DAC_S0_VOLUME);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  is audio mute done or not .
 *
 * @param  adc_id: adc id
 *
 * @return is adc mute done
 *
*******************************************************************************/
BL_Sts_Type Audio_IS_ADC_Mute_Done(Audio_ADC_ID_Type adc_id)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_ADC_ID_TYPE(adc_id));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_STATUS);

    if (adc_id == AUDIO_ADC_0) {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_H0_MUTE_DONE);
    } else if (adc_id == AUDIO_ADC_1) {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_H1_MUTE_DONE);
    } else {
        return BL_IS_REG_BIT_SET(tmpVal, AUDIO_ADC_H2_MUTE_DONE);
    }
}

/****************************************************************************/ /**
 * @brief  is audio mute & volume set are busy or not .
 *
 * @param  adc_id: adc id
 *
 * @return is adc volume set done
 *
*******************************************************************************/
BL_Sts_Type Audio_IS_ADC_Volume_Set_Busy(Audio_ADC_ID_Type adc_id)
{
    uint32_t tmpVal = 0;

