RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_audio.c
    CHECK_PARAM(IS_AUDIO_ADC_CLOCK_TYPE(cfg->adc_clock));
    CHECK_PARAM(IS_AUDIO_DAC_CLOCK_TYPE(cfg->dac_clock));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_AUD_TOP);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_RATE, cfg->adc_clock);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_RATE, cfg->dac_clock);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_PDM_ITF_INV_SEL, cfg->pdm_clk_inv);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC_ITF_INV_SEL, cfg->adc_clk_inv);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_ITF_INV_SEL, cfg->dac_clk_inv);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_CKG_EN, 1);

    BL_WR_REG(AUDIO_BASE, AUDIO_AUD_TOP, tmpVal);

    //TODO to select postion of register interrupt
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(AUDIO_IRQn, AUDIO_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  VAD Configuration function
 *
 * @param  cfg: VAD configuration pra
 *
 * @return None
 *
*******************************************************************************/
void Audio_VAD_Init(Audio_VAD_Cfg_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_AUDIO_VAD_SOURCE_TYPE(cfg->vadSource));
    CHECK_PARAM(IS_AUDIO_VAD_FRAMINGSHIFT_TYPE(cfg->vadFramingShift));
    CHECK_PARAM(IS_AUDIO_VAD_FRAMINGTIME_TYPE(cfg->vadFramingTime));
    CHECK_PARAM(IS_AUDIO_VAD_IRQ_SOURCE_TYPE(cfg->vadIRQSource));
    CHECK_PARAM(IS_AUDIO_VAD_NOISYBUFFERLEN_TYPE(cfg->vadNoisyBufferLen));
    CHECK_PARAM(IS_AUDIO_VAD_NOISYBUFFERMONITOR_TYPE(cfg->vadNoisyBufferMonitor));

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_0);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NBUF_MONIT_EN, cfg->vadNoisyBufferMonitorEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NBUF_MONIT_CTRL, cfg->vadNoisyBufferMonitor);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NBUF_LEN_CTRL, cfg->vadNoisyBufferLen);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_OUT_SEL, cfg->vadIRQSource);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_FRAMETIME_CTRL, cfg->vadFramingTime);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_FRAMESHIFT_CTRL, cfg->vadFramingShift);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_IN_SEL, cfg->vadSource);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NTH_MAXLMT_EN, cfg->vadNoisyMaxLimitEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NTH_MINLMT_EN, cfg->vadNoisyMinLimitEnable);

    BL_WR_REG(AUDIO_BASE, AUDIO_VAD_CTRL_0, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_2);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NTH_MINLMT, cfg->vadNoisyMinLimit);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NTH_MAXLMT, cfg->vadNoisyMaxLimit);

    BL_WR_REG(AUDIO_BASE, AUDIO_VAD_CTRL_2, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_3);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_SMOOTH_FALL, cfg->vadSmoothFall);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_SMOOTH_RISE, cfg->vadSmoothRise);

    BL_WR_REG(AUDIO_BASE, AUDIO_VAD_CTRL_3, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_1);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NTH_SCALE, cfg->noisyBufferThrScale);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NTH_BIAS, cfg->noisyBufferThrBais);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NBUF_DISCARD, cfg->noisyBufferDiscardNumber);

    BL_WR_REG(AUDIO_BASE, AUDIO_VAD_CTRL_1, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_5);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_VAD_NOISE_TH, cfg->noisyBufferThr);

    BL_WR_REG(AUDIO_BASE, AUDIO_VAD_CTRL_5, tmpVal);
}

/****************************************************************************/ /**
 * @brief  enable VAD
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Audio_VAD_Enable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, AUDIO_VAD_EN);
    BL_WR_REG(AUDIO_BASE, AUDIO_VAD_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  disable VAD
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Audio_VAD_Disable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, AUDIO_VAD_EN);
    BL_WR_REG(AUDIO_BASE, AUDIO_VAD_CTRL_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  VAD set EK function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
uint32_t Audio_VAD_Get_EK(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_VAD_CTRL_4);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  audio power on
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Audio_Poweron(void)
{
    uint32_t tmpVal = 0;

    /* common */
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_POWER1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_MICBIAS_PU, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_CODEC_VRDA_EN, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_CODEC_IBIAS_CTRL, 5);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_POWER1, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_POWER2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_LDO25_PU, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_HPBG_PU, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_POWER2, tmpVal);

    /*DAC power on*/
    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_SDAC_LINEOUT, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_LINEOUT_MODE, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_EN_DAC, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_EN_LINEOUT, 1);

