RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_audio.c
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_SDAC_LINEOUT, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_LINEOUT_MODE, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_EN_DAC, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_EN_LINEOUT, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_RG_LO_VREF_RAMP_DCL_EN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DAC_RG_PU_VREF_RAMP, 1);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC_RAMP, tmpVal);

    /*ADC Power on */

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_EN_SDM, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_EN_PGA, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_PGA_GAIN, 8);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_ICTRL_ADC2, 3);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC0, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_EN_SDM, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_EN_PGA, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_PGA_GAIN, 8);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC1, tmpVal);

    tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_EN_SDM, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_EN_PGA, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_PGA_GAIN, 8);
    BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC2, tmpVal);

    /* best digital filter configuration*/
    Audio_Set_DAC_Scaling(1, 14);
}

void Audio_SetADCAnalogGain(Audio_ADC_ID_Type adc, uint8_t analogGain)
{
    uint32_t tmpVal = 0;

    if (adc == AUDIO_ADC_0) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC0_PGA_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC0, tmpVal);
    } else if (adc == AUDIO_ADC_1) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC1_PGA_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC1, tmpVal);
    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_ADC2);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_ADC2_PGA_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_ADC2, tmpVal);
    }
}

void Audio_SetDACAnalogGain(Audio_DAC_ID_Type dac, uint8_t analogGain)
{
    uint32_t tmpVal = 0;

    if (dac == AUDIO_DAC_0) {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACL_LINEOUT_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC, tmpVal);
    } else {
        tmpVal = BL_RD_REG(AUDIO_BASE, AUDIO_CODEC_DAC);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AUDIO_DACR_LINEOUT_GAIN, analogGain);
        BL_WR_REG(AUDIO_BASE, AUDIO_CODEC_DAC, tmpVal);
    }
}

/*@} end of group AUDIO_Public_Functions */

/*@} end of group AUDIO */

/*@} end of group BL808_Peripheral_Driver */
